app/controllers/movies_controller.rb

    if @action
       if @action == 'title'
          @class_title = 'hilite'
          @movies =Movie.where(:rating => @checked).order('title')
       else
          @class_date = 'hilite'
          @movies =Movie.where(:rating => @checked).order("release_date")
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G') ORDER BY release_date